In [62]:
import numpy as np
import pandas as pd
from sklearn import linear_model
from word2number import w2n
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [63]:
pip install word2number

Requirement already satisfied: word2number in c:\users\elaki\anaconda3\lib\site-packages (1.1)
Note: you may need to restart the kernel to use updated packages.

In [64]:
df = pd.read_csv(r"C:\Users\elaki\Downloads\hiring.csv")

In [65]:
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [66]:
df.experience = df.experience.fillna('Zero')

In [67]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       Zero                    8.0                           9      50000
1       Zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [68]:
df.experience = df.experience.apply(w2n.word_to_num)

In [69]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [70]:
import math
median_test_score = math.floor(df['test_score(out of 10)'].mean())
median_test_score

7

In [71]:
dff = df['test_score(out of 10)'].mean()
dff

7.857142857142857

In [72]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(dff)

In [73]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0               8.000000                           9      50000
1           0               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

In [74]:
df.columns

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [77]:
Predictors = ['experience','test_score(out of 10)','interview_score(out of 10)']
x = df[Predictors]
y = df['salary($)']

In [79]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [80]:
x_train.shape,x_test.shape

((6, 3), (2, 3))

In [81]:
y_train.shape,y_test.shape

((6,), (2,))

In [82]:
reg = LinearRegression()

In [83]:
model = reg.fit(x_train,y_train)

In [84]:
model.predict([[8,6,7]])

C:\Users\elaki\anaconda3\Lib\site-packages\sklearn\base.py:493: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([66505.20542892])

In [85]:
model.score(x_train,y_train)

0.945171325224806

In [86]:
model.score(x_test,y_test)

0.9287916364000984